In [1]:
import pandas as pd

# Transaction

In [2]:
raw_data_Tt = pd.read_excel(r'C:\Users\user\Downloads\.ipynb_checkpoints\KPMG_VI_New_raw_data_update_final_copy.xlsx', sheet_name= 'Transactions')

In [3]:
type(raw_data_Tt)

pandas.core.frame.DataFrame

In [4]:
raw_data_Tt

       customer_id order_status
0             2950     Approved
1             3120     Approved
2              402     Approved
3             3135     Approved
4              787     Approved
...            ...          ...
19995         1018     Approved
19996          127     Approved
19997         2284     Approved
19998         2764     Approved
19999         1144     Approved

[20000 rows x 2 columns]

In [5]:
raw_data_Tt.isnull().sum()

customer_id     0
order_status    0
dtype: int64

# Customer Demographic

In [6]:
raw_data_CDd = pd.read_excel(r'C:\Users\user\Downloads\.ipynb_checkpoints\KPMG_VI_New_raw_data_update_final_copy.xlsx', sheet_name= 'CustomerDemographic')

In [7]:
type(raw_data_CDd)

pandas.core.frame.DataFrame

In [8]:
raw_data_CDd

,customer_id,gender,past_3_years_bike_related_purchases,DOB,job_industry_category,wealth_segment,owns_car
0,1,Female,93,1953-10-12,Health,Mass Customer,Yes
1,2,Male,81,1980-12-16,Financial Services,Mass Customer,Yes
2,3,Male,61,1954-01-20,Property,Mass Customer,Yes
3,4,Male,33,1961-10-03,IT,Mass Customer,No
4,5,Female,56,1977-05-13,NaN,Affluent Customer,Yes
...,...,...,...,...,...,...,...
3994,3996,Female,8,1975-08-09,Health,Mass Customer,No
3995,3997,Female,87,2001-07-13,Manufacturing,High Net Worth,Yes
3996,3998,U,60,NaT,IT,High Net Worth,No
3997,3999,Male,11,1973-10-24,Manufacturing,Affluent Customer,Yes
3998,4000,Male,76,1991-11-05,NaN,Affluent Customer,No

In [9]:
raw_data_CDd.isnull().sum()

customer_id                              0
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_industry_category                  656
wealth_segment                           0
owns_car                                 0
dtype: int64

In [10]:
raw_data_CDd['job_industry_category'].value_counts()

Manufacturing         799
Financial Services    774
Health                602
Retail                358
Property              267
IT                    222
Entertainment         136
Argiculture           113
Telecommunications     72
Name: job_industry_category, dtype: int64

In [11]:
raw_data_CDd['job_industry_category']=raw_data_CDd['job_industry_category'].fillna(method='ffill')

In [12]:
raw_data_CDd.isnull().sum()

customer_id                             0
gender                                  0
past_3_years_bike_related_purchases     0
DOB                                    87
job_industry_category                   0
wealth_segment                          0
owns_car                                0
dtype: int64

In [13]:
raw_data_CDd_no_mv = raw_data_CDd.dropna(axis=0)

In [14]:
raw_data_CDd_no_mv.isnull().sum()

customer_id                            0
gender                                 0
past_3_years_bike_related_purchases    0
DOB                                    0
job_industry_category                  0
wealth_segment                         0
owns_car                               0
dtype: int64

In [15]:
raw_data_CDd_no_mv

,customer_id,gender,past_3_years_bike_related_purchases,DOB,job_industry_category,wealth_segment,owns_car
0,1,Female,93,1953-10-12,Health,Mass Customer,Yes
1,2,Male,81,1980-12-16,Financial Services,Mass Customer,Yes
2,3,Male,61,1954-01-20,Property,Mass Customer,Yes
3,4,Male,33,1961-10-03,IT,Mass Customer,No
4,5,Female,56,1977-05-13,IT,Affluent Customer,Yes
...,...,...,...,...,...,...,...
3993,3995,Male,93,1975-12-12,Manufacturing,Mass Customer,Yes
3994,3996,Female,8,1975-08-09,Health,Mass Customer,No
3995,3997,Female,87,2001-07-13,Manufacturing,High Net Worth,Yes
3997,3999,Male,11,1973-10-24,Manufacturing,Affluent Customer,Yes
3998,4000,Male,76,1991-11-05,Manufacturing,Affluent Customer,No

In [16]:
raw_data_CDd_no_mv['gender'].value_counts()

Female    2039
Male      1873
Name: gender, dtype: int64

# Customer Address

In [17]:
raw_data_CAa = pd.read_excel(r'C:\Users\user\Downloads\.ipynb_checkpoints\KPMG_VI_New_raw_data_update_final_copy.xlsx', sheet_name= 'CustomerAddress')

In [18]:
type(raw_data_CAa)

pandas.core.frame.DataFrame

In [19]:
raw_data_CAa

      customer_id            state
0               1  New South Wales
1               2  New South Wales
2               4       Queensland
3               5  New South Wales
4               6         Victoria
...           ...              ...
3994         3999         Victoria
3995         4000       Queensland
3996         4001  New South Wales
3997         4002       Queensland
3998         4003  New South Wales

[3999 rows x 2 columns]

In [20]:
raw_data_CAa.isnull().sum()

customer_id    0
state          0
dtype: int64

In [21]:
import matplotlib.pyplot as plt

In [22]:
df_inner1 = pd.merge(raw_data_CDd_no_mv, raw_data_CAa, on= 'customer_id', how= 'inner')
df_inner1

,customer_id,gender,past_3_years_bike_related_purchases,DOB,job_industry_category,wealth_segment,owns_car,state
0,1,Female,93,1953-10-12,Health,Mass Customer,Yes,New South Wales
1,2,Male,81,1980-12-16,Financial Services,Mass Customer,Yes,New South Wales
2,4,Male,33,1961-10-03,IT,Mass Customer,No,Queensland
3,5,Female,56,1977-05-13,IT,Affluent Customer,Yes,New South Wales
4,6,Male,35,1966-09-16,Retail,High Net Worth,Yes,Victoria
...,...,...,...,...,...,...,...,...
3903,3995,Male,93,1975-12-12,Manufacturing,Mass Customer,Yes,New South Wales
3904,3996,Female,8,1975-08-09,Health,Mass Customer,No,Victoria
3905,3997,Female,87,2001-07-13,Manufacturing,High Net Worth,Yes,New South Wales
3906,3999,Male,11,1973-10-24,Manufacturing,Affluent Customer,Yes,Victoria
3907,4000,Male,76,1991-11-05,Manufacturing,Affluent Customer,No,Queensland

In [23]:
df_inner1.isnull().sum()

customer_id                            0
gender                                 0
past_3_years_bike_related_purchases    0
DOB                                    0
job_industry_category                  0
wealth_segment                         0
owns_car                               0
state                                  0
dtype: int64

In [24]:
final_df1 = pd.merge(df_inner1, raw_data_Tt, on= 'customer_id', how= 'inner')
final_df1

,customer_id,gender,past_3_years_bike_related_purchases,DOB,job_industry_category,wealth_segment,owns_car,state,order_status
0,1,Female,93,1953-10-12,Health,Mass Customer,Yes,New South Wales,Approved
1,1,Female,93,1953-10-12,Health,Mass Customer,Yes,New South Wales,Approved
2,1,Female,93,1953-10-12,Health,Mass Customer,Yes,New South Wales,Approved
3,1,Female,93,1953-10-12,Health,Mass Customer,Yes,New South Wales,Approved
4,1,Female,93,1953-10-12,Health,Mass Customer,Yes,New South Wales,Approved
...,...,...,...,...,...,...,...,...,...
19508,3500,Female,71,1967-07-21,Entertainment,Affluent Customer,No,New South Wales,Approved
19509,3500,Female,71,1967-07-21,Entertainment,Affluent Customer,No,New South Wales,Approved
19510,3500,Female,71,1967-07-21,Entertainment,Affluent Customer,No,New South Wales,Approved
19511,3500,Female,71,1967-07-21,Entertainment,Affluent Customer,No,New South Wales,Approved
19512,3500,Female,71,1967-07-21,Entertainment,Affluent Customer,No,New South Wales,Approved

In [25]:
final_df1.isnull().sum()

customer_id                            0
gender                                 0
past_3_years_bike_related_purchases    0
DOB                                    0
job_industry_category                  0
wealth_segment                         0
owns_car                               0
state                                  0
order_status                           0
dtype: int64

In [26]:
final_df1 = final_df1.drop(['customer_id'], axis = 1)

In [27]:
final_df1.isnull().sum()

gender                                 0
past_3_years_bike_related_purchases    0
DOB                                    0
job_industry_category                  0
wealth_segment                         0
owns_car                               0
state                                  0
order_status                           0
dtype: int64

In [28]:
final_df1.columns.values

array(['gender', 'past_3_years_bike_related_purchases', 'DOB',
       'job_industry_category', 'wealth_segment', 'owns_car', 'state',
       'order_status'], dtype=object)

In [29]:
cols = ['past_3_years_bike_related_purchases', 'DOB', 'gender', 
       'job_industry_category', 'wealth_segment', 'owns_car', 'state',
       'order_status']

In [30]:
df_preprocessed1 = final_df1[cols]
df_preprocessed1.head()

,past_3_years_bike_related_purchases,DOB,gender,job_industry_category,wealth_segment,owns_car,state,order_status
0,93,1953-10-12,Female,Health,Mass Customer,Yes,New South Wales,Approved
1,93,1953-10-12,Female,Health,Mass Customer,Yes,New South Wales,Approved
2,93,1953-10-12,Female,Health,Mass Customer,Yes,New South Wales,Approved
3,93,1953-10-12,Female,Health,Mass Customer,Yes,New South Wales,Approved
4,93,1953-10-12,Female,Health,Mass Customer,Yes,New South Wales,Approved

In [32]:
df_preprocessed1.to_csv('Old_Customer_List.csv', index= False)